app/views/users/show_personal_profile.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
      <tr>
        <td><%= User.find(post.user_id).name %></td>