app/views/tutee_searches/show.html.erb

    <h1 class="card-title"><%= @tutee_search.title %></h1>
    <h6 class="card-subtitle mb-2 text-muted">For [<%= @tutee_search.number.subject.name %><%= @tutee_search.number.name %>], Posted by <%= link_to User.find(@tutee_search.user_id).name, "/users/" + @tutee_search.user_id.to_s %> on <strong><%= @tutee_search.created_at.to_formatted_s(:long_ordinal)%></strong></h6>
---
SELECT  "numbers".* FROM "numbers" WHERE "numbers"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]


    <% @tutee_search.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."tutee_search_id" = $1  [["tutee_search_id", 1]]