app/views/tutor_searches/show.html.erb

SELECT  "numbers".* FROM "numbers" WHERE "numbers"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
    <h1 class="card-title"><%= @tutor_search.title %></h1>
    <h6 class="card-subtitle mb-2 text-muted">For [<%= @tutor_search.number.subject.name %><%= @tutor_search.number.name %>], Posted by <%= link_to User.find(@tutor_search.user_id).name, "/users/" + @tutor_search.user_id.to_s %> on <strong><%= @tutor_search.created_at.to_formatted_s(:long_ordinal)%></strong></h6>

SELECT "comments".* FROM "comments" WHERE "comments"."tutor_search_id" = ?  [["tutor_search_id", 1]]
---
    <h6 class="card-subtitle mb-2 text-muted"> haggle haggle haggle 👌🏽</h6>
    <% @tutor_search.comments.each do |comment| %>