app/controllers/comments_controller.rb

INSERT INTO "comments" ("text", "tutee_search_id", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["text", "what time can you make it"], ["tutee_search_id", 1], ["author", "facebookuser"], ["created_at", "2020-03-06 22:49:59.750589"], ["updated_at", "2020-03-06 22:49:59.750589"]]
---
  def create_comment
    comment_text = params["comment_text"]["text"]
    if params[:post_type] ==  "tutor"
      tutor_search_id = params[:id]
    else
      tutee_search_id = params[:id]
    end
    Comment.create(text: comment_text, tutor_search_id: tutor_search_id, tutee_search_id: tutee_search_id, author: current_user.name)