app/controllers/numbers_controller.rb

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "numbers".* FROM "numbers" WHERE "numbers"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "tutor_searches".* FROM "tutor_searches" WHERE "tutor_searches"."number_id" = $1  [["number_id", 1]]
SELECT "tutee_searches".* FROM "tutee_searches" WHERE "tutee_searches"."number_id" = $1  [["number_id", 1]]
---
  def show
    if current_user
      @subject = Subject.find(params[:subject_id])
      @number = Number.find(params[:id])
      @tutor_searches = TutorSearch.where(number_id: @number.id)
      @tutee_searches = TuteeSearch.where(number_id: @number.id)

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "numbers".* FROM "numbers" WHERE "numbers"."subject_id" = $1  [["subject_id", 1]]
---
  def index
    if current_user
      @subject = Subject.find(params[:subject_id])
      @numbers = Number.where(subject_id: params[:subject_id])

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "numbers".* FROM "numbers" WHERE "numbers"."name" = $1 AND "numbers"."subject_id" = $2 LIMIT 1  [["name", "4118"], ["subject_id", 1]]
INSERT INTO "numbers" ("name", "subject_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "4118"], ["subject_id", 1], ["created_at", "2020-04-02 01:36:14.656271"], ["updated_at", "2020-04-02 01:36:14.656271"]]
---
  def create
    @subject = Subject.find(params[:subject_id])
    @number = Number.find_by(name: params[:name], subject_id: @subject.id)
    unless @number
      @number = @subject.numbers.create(name:params[:name])