app/controllers/requests_controller.rb

INSERT INTO "requests" ("text", "title", "contact", "number_id", "requester_id", "receiver_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
UPDATE "requests" SET "tutor_search_id" = $1, "updated_at" = $2 WHERE "requests"."id" = $3  [["tutor_search_id", 1], ["updated_at", "2020-04-04 01:21:18.691579"], ["id", 1]]
---
  def create
    puts('****')
    @request = Request.create(text: params[:text], title: params[:title], contact: params[:contact],
                              number_id: params[:number_id], requester_id: params[:requester_id],
                              receiver_id: params[:receiver_id])
    if params[:tutee_search_id]
      @request.tutee_search_id = params[:tutee_search_id]
    end

    if params[:tutor_search_id]
      @request.tutor_search_id = params[:tutor_search_id]
    end

    if @request.save

SELECT  "requests".* FROM "requests" WHERE "requests"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    puts(params)
    @request = Request.find(params[:id])