app/controllers/subjects_controller.rb

  def show
    if current_user
      @subject = Subject.find(params[:id])
      @numbers = Number.where(subject_id: @subject.id)
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "numbers".* FROM "numbers" WHERE "numbers"."subject_id" = $1  [["subject_id", 1]]

  def index
    if current_user
      @subjects = Subject.all
---
SELECT "subjects".* FROM "subjects"

  def create
    @subject = Subject.find_by_name(params[:name])
    unless @subject
      @subject = Subject.create(name: params[:name])
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."name" = $1 LIMIT 1  [["name", "COMS"]]
INSERT INTO "subjects" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "COMS"], ["created_at", "2020-04-02 00:51:49.776026"], ["updated_at", "2020-04-02 00:51:49.776026"]]