app/controllers/tutee_searches_controller.rb

SELECT "tutee_searches".* FROM "tutee_searches"
---
  def index
    if current_user
      @tutee_searches = TuteeSearch.all

SELECT  "numbers".* FROM "numbers" WHERE "numbers"."id" = $1 LIMIT 1  [["id", 3]]
---
  def new
    if current_user
      @tutee_search = TuteeSearch.new
      @number = Number.find(params[:number_id])

INSERT INTO "tutee_searches" ("title", "text", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "123"], ["text", "123123"], ["user_id", 1], ["created_at", "2020-04-02 00:41:29.702528"], ["updated_at", "2020-04-02 00:41:29.702528"]]
UPDATE "tutee_searches" SET "number_id" = $1, "updated_at" = $2 WHERE "tutee_searches"."id" = $3  [["number_id", 3], ["updated_at", "2020-04-02 02:16:22.038973"], ["id", 4]]
---
  def create
    if current_user
      @tutee_search = current_user.tutee_searches.create(tutee_search_params)
      @tutee_search.number_id = params[:number_id]
      if @tutee_search.save

SELECT  "tutee_searches".* FROM "tutee_searches" WHERE "tutee_searches"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    if current_user
      @tutee_search = TuteeSearch.find(params[:id])