app/controllers/tutor_searches_controller.rb

SELECT "tutor_searches".* FROM "tutor_searches"
---
  def index
    @tutor_searches = TutorSearch.all

SELECT  "numbers".* FROM "numbers" WHERE "numbers"."id" = $1 LIMIT 1  [["id", nil]]
---
  def new
    @tutor_search = TutorSearch.new
    @number = Number.find(params[:number_id])

INSERT INTO "tutor_searches" ("title", "text", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "1111"], ["text", "2222"], ["user_id", 1], ["created_at", "2020-04-03 14:12:52.912819"], ["updated_at", "2020-04-03 14:12:52.912819"]]
UPDATE "tutor_searches" SET "number_id" = $1, "updated_at" = $2 WHERE "tutor_searches"."id" = $3  [["number_id", 1], ["updated_at", "2020-04-03 14:17:20.983528"], ["id", 3]]
---
  def create
    @tutor_search = current_user.tutor_searches.create(tutor_search_params)
    @tutor_search.number_id = params[:number_id]
    if @tutor_search.save

SELECT  "tutor_searches".* FROM "tutor_searches" WHERE "tutor_searches"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @tutor_search = TutorSearch.find(params[:id])