app/controllers/users_controller.rb

	def show_personal_profile
		unless session[:user_id]
			# if someone is not logged in and somehow
			# managed to get to personal profile page, redirect them to the log in page
			redirect_to root_url
		end
		@my_tutor_searches = TutorSearch.where(user_id: current_user.id)
		@my_tutee_searches = TuteeSearch.where(user_id: current_user.id)
---
SELECT  "tutor_searches".* FROM "tutor_searches" WHERE "tutor_searches"."user_id" = ? LIMIT 1  [["user_id", 2]]
SELECT  "tutee_searches".* FROM "tutee_searches" WHERE "tutee_searches"."user_id" = ? LIMIT 1  [["user_id", 2]]

	def show
		@arb_user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]

	def update
		bio_text = params["bio"]["text"]
		User.update_bio(params["id"], bio_text)
---
UPDATE "users" SET "bio" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["bio", "Comment ça va?"], ["updated_at", "2020-03-04 05:56:39.877806"], ["id", 2]]