app/controllers/welcome_controller.rb

SELECT "tutor_searches".* FROM "tutor_searches"
SELECT "tutee_searches".* FROM "tutee_searches"
---
	def show
#<<<<<<< HEAD
		if current_user
			@tutor_searches = TutorSearch.all
			@tutee_searches = TuteeSearch.all